## Plan Result (prod_landing - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 1 to change, 3 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb_backend_address_pool.shir
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb_rule.shir
* Update
  * module.data_landing_zone[&#34;00&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]
* Replace
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb.shir_lb
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb_nat_pool.shir
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb_probe.shir




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].module.shir001.azurerm_lb.shir_lb must be replaced
-/+ resource "azurerm_lb" "shir_lb" {
      ~ id                   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-prod" -> (known after apply)
        name                 = "ingest00-shir001-lb-prod"
      ~ private_ip_address   = "10.247.43.20" -> (known after apply)
      ~ private_ip_addresses = [
          - "10.247.43.20",
        ] -> (known after apply)
      ~ sku                  = "Basic" -> "Standard" # forces replacement
        tags                 = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (4 unchanged attributes hidden)

      ~ frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          ~ id                                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-prod/frontendIPConfigurations/ingest00-shir001-lb-frontend-prod" -> (known after apply)
          ~ inbound_nat_rules                                  = [
              - "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-prod/inboundNatRules/ingest00-shir001-natpool-prod.1",
            ] -> (known after apply)
          ~ load_balancer_rules                                = [] -> (known after apply)
            name                                               = "ingest00-shir001-lb-frontend-prod"
          ~ outbound_rules                                     = [] -> (known after apply)
          ~ private_ip_address                                 = "10.247.43.20" -> (known after apply)
          ~ private_ip_address_version                         = "IPv4" -> (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          - zones                                              = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["00"].module.shir001.azurerm_lb_backend_address_pool.shir will be created
  + resource "azurerm_lb_backend_address_pool" "shir" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + inbound_nat_rules         = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "ingest00-shir001"
      + outbound_rules            = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.azurerm_lb_nat_pool.shir must be replaced
-/+ resource "azurerm_lb_nat_pool" "shir" {
      - floating_ip_enabled            = false -> null
      ~ frontend_ip_configuration_id   = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-prod/frontendIPConfigurations/ingest00-shir001-lb-frontend-prod" -> (known after apply)
      ~ id                             = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-prod/inboundNatPools/ingest00-shir001-natpool-prod" -> (known after apply)
      ~ loadbalancer_id                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-prod" -> (known after apply) # forces replacement
        name                           = "ingest00-shir001-natpool-prod"
      - tcp_reset_enabled              = false -> null
        # (7 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.shir001.azurerm_lb_probe.shir must be replaced
-/+ resource "azurerm_lb_probe" "shir" {
      ~ id                  = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-prod/probes/ingest00-shir001-probe-prod" -> (known after apply)
      ~ load_balancer_rules = [] -> (known after apply)
      ~ loadbalancer_id     = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-prod" -> (known after apply) # forces replacement
        name                = "ingest00-shir001-probe-prod"
        # (6 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.shir001.azurerm_lb_rule.shir will be created
  + resource "azurerm_lb_rule" "shir" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "ingest00-shir001-lb-frontend-prod"
      + frontend_port                  = 80
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 5
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "ingest00-shir001-rule-prod"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
        id                                                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Compute/virtualMachineScaleSets/ingest00-shir001-vmss-prod"
        name                                              = "ingest00-shir001-vmss-prod"
        tags                                              = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (33 unchanged attributes hidden)

      ~ network_interface {
            name                          = "ingest00-shir001-nic"
            # (5 unchanged attributes hidden)

          ~ ip_configuration {
              ~ load_balancer_backend_address_pool_ids       = [] -> (known after apply)
              ~ load_balancer_inbound_nat_rules_ids          = [
                  - "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-prod/inboundNatPools/ingest00-shir001-natpool-prod",
                ] -> (known after apply)
                name                                         = "ingest00-shir001-ipconfig"
                # (5 unchanged attributes hidden)
            }
        }

      - scale_in {
          - force_deletion_enabled = false -> null
          - rule                   = "Default" -> null
        }

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 1 to change, 3 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_landing_zone["00"].module.shir001.azurerm_lb_backend_address_pool.shir has been deleted
  - resource "azurerm_lb_backend_address_pool" "shir" {
      - id                        = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-prod/backendAddressPools/ingest00-shir001" -> null
        name                      = "ingest00-shir001"
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":59,"Program":"tfcmt","SHA1":"","Target":"prod_landing - TerraformPlanApply","Vars":{}} -->